# DimensionCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RepeatingReferenceSource..::..DimensionCount Property
RepeatingReferenceSource Class See Also
---
The dimension count of the repeating reference array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int DimensionCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DimensionCount As Integer
	Get
```

Visual C++
---
```text
public:
property int DimensionCount {
	int get ();
}
```

# See Also
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace